src/test/resources/xml/invalid-message.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<test xmlns="http://www.example.org/schema">
			<number>not-number</number>
		</test>
	</soapenv:Body>
</soapenv:Envelope>